app/views/movies/show.html.erb


<% @movie.authors.each do |author| %>
---
SELECT "authors".* FROM "authors" INNER JOIN "authors_movies" ON "authors"."id" = "authors_movies"."author_id" WHERE "authors_movies"."movie_id" = ?  [["movie_id", 1]]