app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Filme 1"], ["year", 1111], ["created_at", "2022-11-24 17:48:18.221549"], ["updated_at", "2022-11-24 17:48:18.221549"]]
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

SELECT "authors"."name", "authors"."id" FROM "authors"
---
    def set_authors
      @authors = Author.all.pluck(:name, :id)